content/books/88_names.md
+++
title = "88 Names"
author = ["Matt Ruff"]
date = 2026-07-18
tags = ["scifi", "thriller", "book"]
draft = false
+++

[88 Names](https://www.goodreads.com/book/show/44148558-88-names) (2020)


## Description {#description}

John Chu is a "sherpa" — a paid guide who leads clients through online role-playing games like the popular **Call to Wizardry**, providing them with top-tier characters and gear for dragon-slaying, starship-hunting, or zombie-apocalypse adventures. When he's hired to guide a mysterious new client claiming to be a North Korean prince, the job pulls him into real-world political intrigue where identity is fluid and nothing online can be taken at face value. Part cyberthriller, part twisted romantic comedy.
